RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/mjpeg_q_reg.h
/* 0x420 : mjpeg_q_param_10 */
#define MJPEG_Q_PARAM_10_OFFSET (0x420)
#define MJPEG_Q_REG_Q_0_10      MJPEG_Q_REG_Q_0_10
#define MJPEG_Q_REG_Q_0_10_POS  (0U)
#define MJPEG_Q_REG_Q_0_10_LEN  (12U)
#define MJPEG_Q_REG_Q_0_10_MSK  (((1U << MJPEG_Q_REG_Q_0_10_LEN) - 1) << MJPEG_Q_REG_Q_0_10_POS)
#define MJPEG_Q_REG_Q_0_10_UMSK (~(((1U << MJPEG_Q_REG_Q_0_10_LEN) - 1) << MJPEG_Q_REG_Q_0_10_POS))
#define MJPEG_Q_REG_Q_0_11      MJPEG_Q_REG_Q_0_11
#define MJPEG_Q_REG_Q_0_11_POS  (16U)
#define MJPEG_Q_REG_Q_0_11_LEN  (12U)
#define MJPEG_Q_REG_Q_0_11_MSK  (((1U << MJPEG_Q_REG_Q_0_11_LEN) - 1) << MJPEG_Q_REG_Q_0_11_POS)
#define MJPEG_Q_REG_Q_0_11_UMSK (~(((1U << MJPEG_Q_REG_Q_0_11_LEN) - 1) << MJPEG_Q_REG_Q_0_11_POS))

/* 0x424 : mjpeg_q_param_12 */
#define MJPEG_Q_PARAM_12_OFFSET (0x424)
#define MJPEG_Q_REG_Q_0_12      MJPEG_Q_REG_Q_0_12
#define MJPEG_Q_REG_Q_0_12_POS  (0U)
#define MJPEG_Q_REG_Q_0_12_LEN  (12U)
#define MJPEG_Q_REG_Q_0_12_MSK  (((1U << MJPEG_Q_REG_Q_0_12_LEN) - 1) << MJPEG_Q_REG_Q_0_12_POS)
#define MJPEG_Q_REG_Q_0_12_UMSK (~(((1U << MJPEG_Q_REG_Q_0_12_LEN) - 1) << MJPEG_Q_REG_Q_0_12_POS))
#define MJPEG_Q_REG_Q_0_13      MJPEG_Q_REG_Q_0_13
#define MJPEG_Q_REG_Q_0_13_POS  (16U)
#define MJPEG_Q_REG_Q_0_13_LEN  (12U)
#define MJPEG_Q_REG_Q_0_13_MSK  (((1U << MJPEG_Q_REG_Q_0_13_LEN) - 1) << MJPEG_Q_REG_Q_0_13_POS)
#define MJPEG_Q_REG_Q_0_13_UMSK (~(((1U << MJPEG_Q_REG_Q_0_13_LEN) - 1) << MJPEG_Q_REG_Q_0_13_POS))

/* 0x428 : mjpeg_q_param_14 */
#define MJPEG_Q_PARAM_14_OFFSET (0x428)
#define MJPEG_Q_REG_Q_0_14      MJPEG_Q_REG_Q_0_14
#define MJPEG_Q_REG_Q_0_14_POS  (0U)
#define MJPEG_Q_REG_Q_0_14_LEN  (12U)
#define MJPEG_Q_REG_Q_0_14_MSK  (((1U << MJPEG_Q_REG_Q_0_14_LEN) - 1) << MJPEG_Q_REG_Q_0_14_POS)
#define MJPEG_Q_REG_Q_0_14_UMSK (~(((1U << MJPEG_Q_REG_Q_0_14_LEN) - 1) << MJPEG_Q_REG_Q_0_14_POS))
#define MJPEG_Q_REG_Q_0_15      MJPEG_Q_REG_Q_0_15
#define MJPEG_Q_REG_Q_0_15_POS  (16U)
#define MJPEG_Q_REG_Q_0_15_LEN  (12U)
#define MJPEG_Q_REG_Q_0_15_MSK  (((1U << MJPEG_Q_REG_Q_0_15_LEN) - 1) << MJPEG_Q_REG_Q_0_15_POS)
#define MJPEG_Q_REG_Q_0_15_UMSK (~(((1U << MJPEG_Q_REG_Q_0_15_LEN) - 1) << MJPEG_Q_REG_Q_0_15_POS))

/* 0x42C : mjpeg_q_param_16 */
#define MJPEG_Q_PARAM_16_OFFSET (0x42C)
#define MJPEG_Q_REG_Q_0_16      MJPEG_Q_REG_Q_0_16
#define MJPEG_Q_REG_Q_0_16_POS  (0U)
#define MJPEG_Q_REG_Q_0_16_LEN  (12U)
#define MJPEG_Q_REG_Q_0_16_MSK  (((1U << MJPEG_Q_REG_Q_0_16_LEN) - 1) << MJPEG_Q_REG_Q_0_16_POS)
#define MJPEG_Q_REG_Q_0_16_UMSK (~(((1U << MJPEG_Q_REG_Q_0_16_LEN) - 1) << MJPEG_Q_REG_Q_0_16_POS))
#define MJPEG_Q_REG_Q_0_17      MJPEG_Q_REG_Q_0_17
#define MJPEG_Q_REG_Q_0_17_POS  (16U)
#define MJPEG_Q_REG_Q_0_17_LEN  (12U)
#define MJPEG_Q_REG_Q_0_17_MSK  (((1U << MJPEG_Q_REG_Q_0_17_LEN) - 1) << MJPEG_Q_REG_Q_0_17_POS)
#define MJPEG_Q_REG_Q_0_17_UMSK (~(((1U << MJPEG_Q_REG_Q_0_17_LEN) - 1) << MJPEG_Q_REG_Q_0_17_POS))

/* 0x430 : mjpeg_q_param_18 */
#define MJPEG_Q_PARAM_18_OFFSET (0x430)
#define MJPEG_Q_REG_Q_0_18      MJPEG_Q_REG_Q_0_18
#define MJPEG_Q_REG_Q_0_18_POS  (0U)
#define MJPEG_Q_REG_Q_0_18_LEN  (12U)
#define MJPEG_Q_REG_Q_0_18_MSK  (((1U << MJPEG_Q_REG_Q_0_18_LEN) - 1) << MJPEG_Q_REG_Q_0_18_POS)
#define MJPEG_Q_REG_Q_0_18_UMSK (~(((1U << MJPEG_Q_REG_Q_0_18_LEN) - 1) << MJPEG_Q_REG_Q_0_18_POS))
#define MJPEG_Q_REG_Q_0_19      MJPEG_Q_REG_Q_0_19
#define MJPEG_Q_REG_Q_0_19_POS  (16U)
#define MJPEG_Q_REG_Q_0_19_LEN  (12U)
#define MJPEG_Q_REG_Q_0_19_MSK  (((1U << MJPEG_Q_REG_Q_0_19_LEN) - 1) << MJPEG_Q_REG_Q_0_19_POS)
#define MJPEG_Q_REG_Q_0_19_UMSK (~(((1U << MJPEG_Q_REG_Q_0_19_LEN) - 1) << MJPEG_Q_REG_Q_0_19_POS))

/* 0x434 : mjpeg_q_param_1a */
#define MJPEG_Q_PARAM_1A_OFFSET (0x434)
#define MJPEG_Q_REG_Q_0_1A      MJPEG_Q_REG_Q_0_1A
#define MJPEG_Q_REG_Q_0_1A_POS  (0U)
#define MJPEG_Q_REG_Q_0_1A_LEN  (12U)
#define MJPEG_Q_REG_Q_0_1A_MSK  (((1U << MJPEG_Q_REG_Q_0_1A_LEN) - 1) << MJPEG_Q_REG_Q_0_1A_POS)
#define MJPEG_Q_REG_Q_0_1A_UMSK (~(((1U << MJPEG_Q_REG_Q_0_1A_LEN) - 1) << MJPEG_Q_REG_Q_0_1A_POS))
#define MJPEG_Q_REG_Q_0_1B      MJPEG_Q_REG_Q_0_1B
#define MJPEG_Q_REG_Q_0_1B_POS  (16U)
#define MJPEG_Q_REG_Q_0_1B_LEN  (12U)
#define MJPEG_Q_REG_Q_0_1B_MSK  (((1U << MJPEG_Q_REG_Q_0_1B_LEN) - 1) << MJPEG_Q_REG_Q_0_1B_POS)
#define MJPEG_Q_REG_Q_0_1B_UMSK (~(((1U << MJPEG_Q_REG_Q_0_1B_LEN) - 1) << MJPEG_Q_REG_Q_0_1B_POS))

/* 0x438 : mjpeg_q_param_1c */
#define MJPEG_Q_PARAM_1C_OFFSET (0x438)
#define MJPEG_Q_REG_Q_0_1C      MJPEG_Q_REG_Q_0_1C
#define MJPEG_Q_REG_Q_0_1C_POS  (0U)
#define MJPEG_Q_REG_Q_0_1C_LEN  (12U)
#define MJPEG_Q_REG_Q_0_1C_MSK  (((1U << MJPEG_Q_REG_Q_0_1C_LEN) - 1) << MJPEG_Q_REG_Q_0_1C_POS)
#define MJPEG_Q_REG_Q_0_1C_UMSK (~(((1U << MJPEG_Q_REG_Q_0_1C_LEN) - 1) << MJPEG_Q_REG_Q_0_1C_POS))
#define MJPEG_Q_REG_Q_0_1D      MJPEG_Q_REG_Q_0_1D
#define MJPEG_Q_REG_Q_0_1D_POS  (16U)
#define MJPEG_Q_REG_Q_0_1D_LEN  (12U)
#define MJPEG_Q_REG_Q_0_1D_MSK  (((1U << MJPEG_Q_REG_Q_0_1D_LEN) - 1) << MJPEG_Q_REG_Q_0_1D_POS)
#define MJPEG_Q_REG_Q_0_1D_UMSK (~(((1U << MJPEG_Q_REG_Q_0_1D_LEN) - 1) << MJPEG_Q_REG_Q_0_1D_POS))

/* 0x43C : mjpeg_q_param_1e */
#define MJPEG_Q_PARAM_1E_OFFSET (0x43C)
#define MJPEG_Q_REG_Q_0_1E      MJPEG_Q_REG_Q_0_1E
#define MJPEG_Q_REG_Q_0_1E_POS  (0U)
#define MJPEG_Q_REG_Q_0_1E_LEN  (12U)
#define MJPEG_Q_REG_Q_0_1E_MSK  (((1U << MJPEG_Q_REG_Q_0_1E_LEN) - 1) << MJPEG_Q_REG_Q_0_1E_POS)
#define MJPEG_Q_REG_Q_0_1E_UMSK (~(((1U << MJPEG_Q_REG_Q_0_1E_LEN) - 1) << MJPEG_Q_REG_Q_0_1E_POS))
#define MJPEG_Q_REG_Q_0_1F      MJPEG_Q_REG_Q_0_1F
#define MJPEG_Q_REG_Q_0_1F_POS  (16U)
#define MJPEG_Q_REG_Q_0_1F_LEN  (12U)
#define MJPEG_Q_REG_Q_0_1F_MSK  (((1U << MJPEG_Q_REG_Q_0_1F_LEN) - 1) << MJPEG_Q_REG_Q_0_1F_POS)
#define MJPEG_Q_REG_Q_0_1F_UMSK (~(((1U << MJPEG_Q_REG_Q_0_1F_LEN) - 1) << MJPEG_Q_REG_Q_0_1F_POS))

/* 0x440 : mjpeg_q_param_20 */
#define MJPEG_Q_PARAM_20_OFFSET (0x440)
#define MJPEG_Q_REG_Q_0_20      MJPEG_Q_REG_Q_0_20
#define MJPEG_Q_REG_Q_0_20_POS  (0U)
#define MJPEG_Q_REG_Q_0_20_LEN  (12U)
#define MJPEG_Q_REG_Q_0_20_MSK  (((1U << MJPEG_Q_REG_Q_0_20_LEN) - 1) << MJPEG_Q_REG_Q_0_20_POS)
#define MJPEG_Q_REG_Q_0_20_UMSK (~(((1U << MJPEG_Q_REG_Q_0_20_LEN) - 1) << MJPEG_Q_REG_Q_0_20_POS))
#define MJPEG_Q_REG_Q_0_21      MJPEG_Q_REG_Q_0_21
#define MJPEG_Q_REG_Q_0_21_POS  (16U)
#define MJPEG_Q_REG_Q_0_21_LEN  (12U)
#define MJPEG_Q_REG_Q_0_21_MSK  (((1U << MJPEG_Q_REG_Q_0_21_LEN) - 1) << MJPEG_Q_REG_Q_0_21_POS)
#define MJPEG_Q_REG_Q_0_21_UMSK (~(((1U << MJPEG_Q_REG_Q_0_21_LEN) - 1) << MJPEG_Q_REG_Q_0_21_POS))

