RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/mjpeg_q_reg.h
/* 0x444 : mjpeg_q_param_22 */
#define MJPEG_Q_PARAM_22_OFFSET (0x444)
#define MJPEG_Q_REG_Q_0_22      MJPEG_Q_REG_Q_0_22
#define MJPEG_Q_REG_Q_0_22_POS  (0U)
#define MJPEG_Q_REG_Q_0_22_LEN  (12U)
#define MJPEG_Q_REG_Q_0_22_MSK  (((1U << MJPEG_Q_REG_Q_0_22_LEN) - 1) << MJPEG_Q_REG_Q_0_22_POS)
#define MJPEG_Q_REG_Q_0_22_UMSK (~(((1U << MJPEG_Q_REG_Q_0_22_LEN) - 1) << MJPEG_Q_REG_Q_0_22_POS))
#define MJPEG_Q_REG_Q_0_23      MJPEG_Q_REG_Q_0_23
#define MJPEG_Q_REG_Q_0_23_POS  (16U)
#define MJPEG_Q_REG_Q_0_23_LEN  (12U)
#define MJPEG_Q_REG_Q_0_23_MSK  (((1U << MJPEG_Q_REG_Q_0_23_LEN) - 1) << MJPEG_Q_REG_Q_0_23_POS)
#define MJPEG_Q_REG_Q_0_23_UMSK (~(((1U << MJPEG_Q_REG_Q_0_23_LEN) - 1) << MJPEG_Q_REG_Q_0_23_POS))

/* 0x448 : mjpeg_q_param_24 */
#define MJPEG_Q_PARAM_24_OFFSET (0x448)
#define MJPEG_Q_REG_Q_0_24      MJPEG_Q_REG_Q_0_24
#define MJPEG_Q_REG_Q_0_24_POS  (0U)
#define MJPEG_Q_REG_Q_0_24_LEN  (12U)
#define MJPEG_Q_REG_Q_0_24_MSK  (((1U << MJPEG_Q_REG_Q_0_24_LEN) - 1) << MJPEG_Q_REG_Q_0_24_POS)
#define MJPEG_Q_REG_Q_0_24_UMSK (~(((1U << MJPEG_Q_REG_Q_0_24_LEN) - 1) << MJPEG_Q_REG_Q_0_24_POS))
#define MJPEG_Q_REG_Q_0_25      MJPEG_Q_REG_Q_0_25
#define MJPEG_Q_REG_Q_0_25_POS  (16U)
#define MJPEG_Q_REG_Q_0_25_LEN  (12U)
#define MJPEG_Q_REG_Q_0_25_MSK  (((1U << MJPEG_Q_REG_Q_0_25_LEN) - 1) << MJPEG_Q_REG_Q_0_25_POS)
#define MJPEG_Q_REG_Q_0_25_UMSK (~(((1U << MJPEG_Q_REG_Q_0_25_LEN) - 1) << MJPEG_Q_REG_Q_0_25_POS))

/* 0x44C : mjpeg_q_param_26 */
#define MJPEG_Q_PARAM_26_OFFSET (0x44C)
#define MJPEG_Q_REG_Q_0_26      MJPEG_Q_REG_Q_0_26
#define MJPEG_Q_REG_Q_0_26_POS  (0U)
#define MJPEG_Q_REG_Q_0_26_LEN  (12U)
#define MJPEG_Q_REG_Q_0_26_MSK  (((1U << MJPEG_Q_REG_Q_0_26_LEN) - 1) << MJPEG_Q_REG_Q_0_26_POS)
#define MJPEG_Q_REG_Q_0_26_UMSK (~(((1U << MJPEG_Q_REG_Q_0_26_LEN) - 1) << MJPEG_Q_REG_Q_0_26_POS))
#define MJPEG_Q_REG_Q_0_27      MJPEG_Q_REG_Q_0_27
#define MJPEG_Q_REG_Q_0_27_POS  (16U)
#define MJPEG_Q_REG_Q_0_27_LEN  (12U)
#define MJPEG_Q_REG_Q_0_27_MSK  (((1U << MJPEG_Q_REG_Q_0_27_LEN) - 1) << MJPEG_Q_REG_Q_0_27_POS)
#define MJPEG_Q_REG_Q_0_27_UMSK (~(((1U << MJPEG_Q_REG_Q_0_27_LEN) - 1) << MJPEG_Q_REG_Q_0_27_POS))

/* 0x450 : mjpeg_q_param_28 */
#define MJPEG_Q_PARAM_28_OFFSET (0x450)
#define MJPEG_Q_REG_Q_0_28      MJPEG_Q_REG_Q_0_28
#define MJPEG_Q_REG_Q_0_28_POS  (0U)
#define MJPEG_Q_REG_Q_0_28_LEN  (12U)
#define MJPEG_Q_REG_Q_0_28_MSK  (((1U << MJPEG_Q_REG_Q_0_28_LEN) - 1) << MJPEG_Q_REG_Q_0_28_POS)
#define MJPEG_Q_REG_Q_0_28_UMSK (~(((1U << MJPEG_Q_REG_Q_0_28_LEN) - 1) << MJPEG_Q_REG_Q_0_28_POS))
#define MJPEG_Q_REG_Q_0_29      MJPEG_Q_REG_Q_0_29
#define MJPEG_Q_REG_Q_0_29_POS  (16U)
#define MJPEG_Q_REG_Q_0_29_LEN  (12U)
#define MJPEG_Q_REG_Q_0_29_MSK  (((1U << MJPEG_Q_REG_Q_0_29_LEN) - 1) << MJPEG_Q_REG_Q_0_29_POS)
#define MJPEG_Q_REG_Q_0_29_UMSK (~(((1U << MJPEG_Q_REG_Q_0_29_LEN) - 1) << MJPEG_Q_REG_Q_0_29_POS))

/* 0x454 : mjpeg_q_param_2a */
#define MJPEG_Q_PARAM_2A_OFFSET (0x454)
#define MJPEG_Q_REG_Q_0_2A      MJPEG_Q_REG_Q_0_2A
#define MJPEG_Q_REG_Q_0_2A_POS  (0U)
#define MJPEG_Q_REG_Q_0_2A_LEN  (12U)
#define MJPEG_Q_REG_Q_0_2A_MSK  (((1U << MJPEG_Q_REG_Q_0_2A_LEN) - 1) << MJPEG_Q_REG_Q_0_2A_POS)
#define MJPEG_Q_REG_Q_0_2A_UMSK (~(((1U << MJPEG_Q_REG_Q_0_2A_LEN) - 1) << MJPEG_Q_REG_Q_0_2A_POS))
#define MJPEG_Q_REG_Q_0_2B      MJPEG_Q_REG_Q_0_2B
#define MJPEG_Q_REG_Q_0_2B_POS  (16U)
#define MJPEG_Q_REG_Q_0_2B_LEN  (12U)
#define MJPEG_Q_REG_Q_0_2B_MSK  (((1U << MJPEG_Q_REG_Q_0_2B_LEN) - 1) << MJPEG_Q_REG_Q_0_2B_POS)
#define MJPEG_Q_REG_Q_0_2B_UMSK (~(((1U << MJPEG_Q_REG_Q_0_2B_LEN) - 1) << MJPEG_Q_REG_Q_0_2B_POS))

/* 0x458 : mjpeg_q_param_2c */
#define MJPEG_Q_PARAM_2C_OFFSET (0x458)
#define MJPEG_Q_REG_Q_0_2C      MJPEG_Q_REG_Q_0_2C
#define MJPEG_Q_REG_Q_0_2C_POS  (0U)
#define MJPEG_Q_REG_Q_0_2C_LEN  (12U)
#define MJPEG_Q_REG_Q_0_2C_MSK  (((1U << MJPEG_Q_REG_Q_0_2C_LEN) - 1) << MJPEG_Q_REG_Q_0_2C_POS)
#define MJPEG_Q_REG_Q_0_2C_UMSK (~(((1U << MJPEG_Q_REG_Q_0_2C_LEN) - 1) << MJPEG_Q_REG_Q_0_2C_POS))
#define MJPEG_Q_REG_Q_0_2D      MJPEG_Q_REG_Q_0_2D
#define MJPEG_Q_REG_Q_0_2D_POS  (16U)
#define MJPEG_Q_REG_Q_0_2D_LEN  (12U)
#define MJPEG_Q_REG_Q_0_2D_MSK  (((1U << MJPEG_Q_REG_Q_0_2D_LEN) - 1) << MJPEG_Q_REG_Q_0_2D_POS)
#define MJPEG_Q_REG_Q_0_2D_UMSK (~(((1U << MJPEG_Q_REG_Q_0_2D_LEN) - 1) << MJPEG_Q_REG_Q_0_2D_POS))

/* 0x45C : mjpeg_q_param_2e */
#define MJPEG_Q_PARAM_2E_OFFSET (0x45C)
#define MJPEG_Q_REG_Q_0_2E      MJPEG_Q_REG_Q_0_2E
#define MJPEG_Q_REG_Q_0_2E_POS  (0U)
#define MJPEG_Q_REG_Q_0_2E_LEN  (12U)
#define MJPEG_Q_REG_Q_0_2E_MSK  (((1U << MJPEG_Q_REG_Q_0_2E_LEN) - 1) << MJPEG_Q_REG_Q_0_2E_POS)
#define MJPEG_Q_REG_Q_0_2E_UMSK (~(((1U << MJPEG_Q_REG_Q_0_2E_LEN) - 1) << MJPEG_Q_REG_Q_0_2E_POS))
#define MJPEG_Q_REG_Q_0_2F      MJPEG_Q_REG_Q_0_2F
#define MJPEG_Q_REG_Q_0_2F_POS  (16U)
#define MJPEG_Q_REG_Q_0_2F_LEN  (12U)
#define MJPEG_Q_REG_Q_0_2F_MSK  (((1U << MJPEG_Q_REG_Q_0_2F_LEN) - 1) << MJPEG_Q_REG_Q_0_2F_POS)
#define MJPEG_Q_REG_Q_0_2F_UMSK (~(((1U << MJPEG_Q_REG_Q_0_2F_LEN) - 1) << MJPEG_Q_REG_Q_0_2F_POS))

/* 0x460 : mjpeg_q_param_30 */
#define MJPEG_Q_PARAM_30_OFFSET (0x460)
#define MJPEG_Q_REG_Q_0_30      MJPEG_Q_REG_Q_0_30
#define MJPEG_Q_REG_Q_0_30_POS  (0U)
#define MJPEG_Q_REG_Q_0_30_LEN  (12U)
#define MJPEG_Q_REG_Q_0_30_MSK  (((1U << MJPEG_Q_REG_Q_0_30_LEN) - 1) << MJPEG_Q_REG_Q_0_30_POS)
#define MJPEG_Q_REG_Q_0_30_UMSK (~(((1U << MJPEG_Q_REG_Q_0_30_LEN) - 1) << MJPEG_Q_REG_Q_0_30_POS))
#define MJPEG_Q_REG_Q_0_31      MJPEG_Q_REG_Q_0_31
#define MJPEG_Q_REG_Q_0_31_POS  (16U)
#define MJPEG_Q_REG_Q_0_31_LEN  (12U)
#define MJPEG_Q_REG_Q_0_31_MSK  (((1U << MJPEG_Q_REG_Q_0_31_LEN) - 1) << MJPEG_Q_REG_Q_0_31_POS)
#define MJPEG_Q_REG_Q_0_31_UMSK (~(((1U << MJPEG_Q_REG_Q_0_31_LEN) - 1) << MJPEG_Q_REG_Q_0_31_POS))

/* 0x464 : mjpeg_q_param_32 */
#define MJPEG_Q_PARAM_32_OFFSET (0x464)
#define MJPEG_Q_REG_Q_0_32      MJPEG_Q_REG_Q_0_32
#define MJPEG_Q_REG_Q_0_32_POS  (0U)
#define MJPEG_Q_REG_Q_0_32_LEN  (12U)
#define MJPEG_Q_REG_Q_0_32_MSK  (((1U << MJPEG_Q_REG_Q_0_32_LEN) - 1) << MJPEG_Q_REG_Q_0_32_POS)
#define MJPEG_Q_REG_Q_0_32_UMSK (~(((1U << MJPEG_Q_REG_Q_0_32_LEN) - 1) << MJPEG_Q_REG_Q_0_32_POS))
#define MJPEG_Q_REG_Q_0_33      MJPEG_Q_REG_Q_0_33
#define MJPEG_Q_REG_Q_0_33_POS  (16U)
#define MJPEG_Q_REG_Q_0_33_LEN  (12U)
#define MJPEG_Q_REG_Q_0_33_MSK  (((1U << MJPEG_Q_REG_Q_0_33_LEN) - 1) << MJPEG_Q_REG_Q_0_33_POS)
#define MJPEG_Q_REG_Q_0_33_UMSK (~(((1U << MJPEG_Q_REG_Q_0_33_LEN) - 1) << MJPEG_Q_REG_Q_0_33_POS))

/* 0x468 : mjpeg_q_param_34 */
#define MJPEG_Q_PARAM_34_OFFSET (0x468)
#define MJPEG_Q_REG_Q_0_34      MJPEG_Q_REG_Q_0_34
#define MJPEG_Q_REG_Q_0_34_POS  (0U)
#define MJPEG_Q_REG_Q_0_34_LEN  (12U)
#define MJPEG_Q_REG_Q_0_34_MSK  (((1U << MJPEG_Q_REG_Q_0_34_LEN) - 1) << MJPEG_Q_REG_Q_0_34_POS)
#define MJPEG_Q_REG_Q_0_34_UMSK (~(((1U << MJPEG_Q_REG_Q_0_34_LEN) - 1) << MJPEG_Q_REG_Q_0_34_POS))
#define MJPEG_Q_REG_Q_0_35      MJPEG_Q_REG_Q_0_35
#define MJPEG_Q_REG_Q_0_35_POS  (16U)
#define MJPEG_Q_REG_Q_0_35_LEN  (12U)
#define MJPEG_Q_REG_Q_0_35_MSK  (((1U << MJPEG_Q_REG_Q_0_35_LEN) - 1) << MJPEG_Q_REG_Q_0_35_POS)
#define MJPEG_Q_REG_Q_0_35_UMSK (~(((1U << MJPEG_Q_REG_Q_0_35_LEN) - 1) << MJPEG_Q_REG_Q_0_35_POS))

/* 0x46C : mjpeg_q_param_36 */
#define MJPEG_Q_PARAM_36_OFFSET (0x46C)
#define MJPEG_Q_REG_Q_0_36      MJPEG_Q_REG_Q_0_36
#define MJPEG_Q_REG_Q_0_36_POS  (0U)
#define MJPEG_Q_REG_Q_0_36_LEN  (12U)
#define MJPEG_Q_REG_Q_0_36_MSK  (((1U << MJPEG_Q_REG_Q_0_36_LEN) - 1) << MJPEG_Q_REG_Q_0_36_POS)
#define MJPEG_Q_REG_Q_0_36_UMSK (~(((1U << MJPEG_Q_REG_Q_0_36_LEN) - 1) << MJPEG_Q_REG_Q_0_36_POS))
#define MJPEG_Q_REG_Q_0_37      MJPEG_Q_REG_Q_0_37
#define MJPEG_Q_REG_Q_0_37_POS  (16U)
#define MJPEG_Q_REG_Q_0_37_LEN  (12U)
#define MJPEG_Q_REG_Q_0_37_MSK  (((1U << MJPEG_Q_REG_Q_0_37_LEN) - 1) << MJPEG_Q_REG_Q_0_37_POS)
#define MJPEG_Q_REG_Q_0_37_UMSK (~(((1U << MJPEG_Q_REG_Q_0_37_LEN) - 1) << MJPEG_Q_REG_Q_0_37_POS))

/* 0x470 : mjpeg_q_param_38 */
#define MJPEG_Q_PARAM_38_OFFSET (0x470)
#define MJPEG_Q_REG_Q_0_38      MJPEG_Q_REG_Q_0_38
#define MJPEG_Q_REG_Q_0_38_POS  (0U)
#define MJPEG_Q_REG_Q_0_38_LEN  (12U)
#define MJPEG_Q_REG_Q_0_38_MSK  (((1U << MJPEG_Q_REG_Q_0_38_LEN) - 1) << MJPEG_Q_REG_Q_0_38_POS)
#define MJPEG_Q_REG_Q_0_38_UMSK (~(((1U << MJPEG_Q_REG_Q_0_38_LEN) - 1) << MJPEG_Q_REG_Q_0_38_POS))
#define MJPEG_Q_REG_Q_0_39      MJPEG_Q_REG_Q_0_39
#define MJPEG_Q_REG_Q_0_39_POS  (16U)
#define MJPEG_Q_REG_Q_0_39_LEN  (12U)
#define MJPEG_Q_REG_Q_0_39_MSK  (((1U << MJPEG_Q_REG_Q_0_39_LEN) - 1) << MJPEG_Q_REG_Q_0_39_POS)
#define MJPEG_Q_REG_Q_0_39_UMSK (~(((1U << MJPEG_Q_REG_Q_0_39_LEN) - 1) << MJPEG_Q_REG_Q_0_39_POS))

