RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/mjpeg_q_reg.h
/* 0x474 : mjpeg_q_param_3a */
#define MJPEG_Q_PARAM_3A_OFFSET (0x474)
#define MJPEG_Q_REG_Q_0_3A      MJPEG_Q_REG_Q_0_3A
#define MJPEG_Q_REG_Q_0_3A_POS  (0U)
#define MJPEG_Q_REG_Q_0_3A_LEN  (12U)
#define MJPEG_Q_REG_Q_0_3A_MSK  (((1U << MJPEG_Q_REG_Q_0_3A_LEN) - 1) << MJPEG_Q_REG_Q_0_3A_POS)
#define MJPEG_Q_REG_Q_0_3A_UMSK (~(((1U << MJPEG_Q_REG_Q_0_3A_LEN) - 1) << MJPEG_Q_REG_Q_0_3A_POS))
#define MJPEG_Q_REG_Q_0_3B      MJPEG_Q_REG_Q_0_3B
#define MJPEG_Q_REG_Q_0_3B_POS  (16U)
#define MJPEG_Q_REG_Q_0_3B_LEN  (12U)
#define MJPEG_Q_REG_Q_0_3B_MSK  (((1U << MJPEG_Q_REG_Q_0_3B_LEN) - 1) << MJPEG_Q_REG_Q_0_3B_POS)
#define MJPEG_Q_REG_Q_0_3B_UMSK (~(((1U << MJPEG_Q_REG_Q_0_3B_LEN) - 1) << MJPEG_Q_REG_Q_0_3B_POS))

/* 0x478 : mjpeg_q_param_3c */
#define MJPEG_Q_PARAM_3C_OFFSET (0x478)
#define MJPEG_Q_REG_Q_0_3C      MJPEG_Q_REG_Q_0_3C
#define MJPEG_Q_REG_Q_0_3C_POS  (0U)
#define MJPEG_Q_REG_Q_0_3C_LEN  (12U)
#define MJPEG_Q_REG_Q_0_3C_MSK  (((1U << MJPEG_Q_REG_Q_0_3C_LEN) - 1) << MJPEG_Q_REG_Q_0_3C_POS)
#define MJPEG_Q_REG_Q_0_3C_UMSK (~(((1U << MJPEG_Q_REG_Q_0_3C_LEN) - 1) << MJPEG_Q_REG_Q_0_3C_POS))
#define MJPEG_Q_REG_Q_0_3D      MJPEG_Q_REG_Q_0_3D
#define MJPEG_Q_REG_Q_0_3D_POS  (16U)
#define MJPEG_Q_REG_Q_0_3D_LEN  (12U)
#define MJPEG_Q_REG_Q_0_3D_MSK  (((1U << MJPEG_Q_REG_Q_0_3D_LEN) - 1) << MJPEG_Q_REG_Q_0_3D_POS)
#define MJPEG_Q_REG_Q_0_3D_UMSK (~(((1U << MJPEG_Q_REG_Q_0_3D_LEN) - 1) << MJPEG_Q_REG_Q_0_3D_POS))

/* 0x47C : mjpeg_q_param_3e */
#define MJPEG_Q_PARAM_3E_OFFSET (0x47C)
#define MJPEG_Q_REG_Q_0_3E      MJPEG_Q_REG_Q_0_3E
#define MJPEG_Q_REG_Q_0_3E_POS  (0U)
#define MJPEG_Q_REG_Q_0_3E_LEN  (12U)
#define MJPEG_Q_REG_Q_0_3E_MSK  (((1U << MJPEG_Q_REG_Q_0_3E_LEN) - 1) << MJPEG_Q_REG_Q_0_3E_POS)
#define MJPEG_Q_REG_Q_0_3E_UMSK (~(((1U << MJPEG_Q_REG_Q_0_3E_LEN) - 1) << MJPEG_Q_REG_Q_0_3E_POS))
#define MJPEG_Q_REG_Q_0_3F      MJPEG_Q_REG_Q_0_3F
#define MJPEG_Q_REG_Q_0_3F_POS  (16U)
#define MJPEG_Q_REG_Q_0_3F_LEN  (12U)
#define MJPEG_Q_REG_Q_0_3F_MSK  (((1U << MJPEG_Q_REG_Q_0_3F_LEN) - 1) << MJPEG_Q_REG_Q_0_3F_POS)
#define MJPEG_Q_REG_Q_0_3F_UMSK (~(((1U << MJPEG_Q_REG_Q_0_3F_LEN) - 1) << MJPEG_Q_REG_Q_0_3F_POS))

/* 0x480 : mjpeg_q_param_40 */
#define MJPEG_Q_PARAM_40_OFFSET (0x480)
#define MJPEG_Q_REG_Q_1_00      MJPEG_Q_REG_Q_1_00
#define MJPEG_Q_REG_Q_1_00_POS  (0U)
#define MJPEG_Q_REG_Q_1_00_LEN  (12U)
#define MJPEG_Q_REG_Q_1_00_MSK  (((1U << MJPEG_Q_REG_Q_1_00_LEN) - 1) << MJPEG_Q_REG_Q_1_00_POS)
#define MJPEG_Q_REG_Q_1_00_UMSK (~(((1U << MJPEG_Q_REG_Q_1_00_LEN) - 1) << MJPEG_Q_REG_Q_1_00_POS))
#define MJPEG_Q_REG_Q_1_01      MJPEG_Q_REG_Q_1_01
#define MJPEG_Q_REG_Q_1_01_POS  (16U)
#define MJPEG_Q_REG_Q_1_01_LEN  (12U)
#define MJPEG_Q_REG_Q_1_01_MSK  (((1U << MJPEG_Q_REG_Q_1_01_LEN) - 1) << MJPEG_Q_REG_Q_1_01_POS)
#define MJPEG_Q_REG_Q_1_01_UMSK (~(((1U << MJPEG_Q_REG_Q_1_01_LEN) - 1) << MJPEG_Q_REG_Q_1_01_POS))

/* 0x484 : mjpeg_q_param_42 */
#define MJPEG_Q_PARAM_42_OFFSET (0x484)
#define MJPEG_Q_REG_Q_1_02      MJPEG_Q_REG_Q_1_02
#define MJPEG_Q_REG_Q_1_02_POS  (0U)
#define MJPEG_Q_REG_Q_1_02_LEN  (12U)
#define MJPEG_Q_REG_Q_1_02_MSK  (((1U << MJPEG_Q_REG_Q_1_02_LEN) - 1) << MJPEG_Q_REG_Q_1_02_POS)
#define MJPEG_Q_REG_Q_1_02_UMSK (~(((1U << MJPEG_Q_REG_Q_1_02_LEN) - 1) << MJPEG_Q_REG_Q_1_02_POS))
#define MJPEG_Q_REG_Q_1_03      MJPEG_Q_REG_Q_1_03
#define MJPEG_Q_REG_Q_1_03_POS  (16U)
#define MJPEG_Q_REG_Q_1_03_LEN  (12U)
#define MJPEG_Q_REG_Q_1_03_MSK  (((1U << MJPEG_Q_REG_Q_1_03_LEN) - 1) << MJPEG_Q_REG_Q_1_03_POS)
#define MJPEG_Q_REG_Q_1_03_UMSK (~(((1U << MJPEG_Q_REG_Q_1_03_LEN) - 1) << MJPEG_Q_REG_Q_1_03_POS))

/* 0x488 : mjpeg_q_param_44 */
#define MJPEG_Q_PARAM_44_OFFSET (0x488)
#define MJPEG_Q_REG_Q_1_04      MJPEG_Q_REG_Q_1_04
#define MJPEG_Q_REG_Q_1_04_POS  (0U)
#define MJPEG_Q_REG_Q_1_04_LEN  (12U)
#define MJPEG_Q_REG_Q_1_04_MSK  (((1U << MJPEG_Q_REG_Q_1_04_LEN) - 1) << MJPEG_Q_REG_Q_1_04_POS)
#define MJPEG_Q_REG_Q_1_04_UMSK (~(((1U << MJPEG_Q_REG_Q_1_04_LEN) - 1) << MJPEG_Q_REG_Q_1_04_POS))
#define MJPEG_Q_REG_Q_1_05      MJPEG_Q_REG_Q_1_05
#define MJPEG_Q_REG_Q_1_05_POS  (16U)
#define MJPEG_Q_REG_Q_1_05_LEN  (12U)
#define MJPEG_Q_REG_Q_1_05_MSK  (((1U << MJPEG_Q_REG_Q_1_05_LEN) - 1) << MJPEG_Q_REG_Q_1_05_POS)
#define MJPEG_Q_REG_Q_1_05_UMSK (~(((1U << MJPEG_Q_REG_Q_1_05_LEN) - 1) << MJPEG_Q_REG_Q_1_05_POS))

/* 0x48C : mjpeg_q_param_46 */
#define MJPEG_Q_PARAM_46_OFFSET (0x48C)
#define MJPEG_Q_REG_Q_1_06      MJPEG_Q_REG_Q_1_06
#define MJPEG_Q_REG_Q_1_06_POS  (0U)
#define MJPEG_Q_REG_Q_1_06_LEN  (12U)
#define MJPEG_Q_REG_Q_1_06_MSK  (((1U << MJPEG_Q_REG_Q_1_06_LEN) - 1) << MJPEG_Q_REG_Q_1_06_POS)
#define MJPEG_Q_REG_Q_1_06_UMSK (~(((1U << MJPEG_Q_REG_Q_1_06_LEN) - 1) << MJPEG_Q_REG_Q_1_06_POS))
#define MJPEG_Q_REG_Q_1_07      MJPEG_Q_REG_Q_1_07
#define MJPEG_Q_REG_Q_1_07_POS  (16U)
#define MJPEG_Q_REG_Q_1_07_LEN  (12U)
#define MJPEG_Q_REG_Q_1_07_MSK  (((1U << MJPEG_Q_REG_Q_1_07_LEN) - 1) << MJPEG_Q_REG_Q_1_07_POS)
#define MJPEG_Q_REG_Q_1_07_UMSK (~(((1U << MJPEG_Q_REG_Q_1_07_LEN) - 1) << MJPEG_Q_REG_Q_1_07_POS))

/* 0x490 : mjpeg_q_param_48 */
#define MJPEG_Q_PARAM_48_OFFSET (0x490)
#define MJPEG_Q_REG_Q_1_08      MJPEG_Q_REG_Q_1_08
#define MJPEG_Q_REG_Q_1_08_POS  (0U)
#define MJPEG_Q_REG_Q_1_08_LEN  (12U)
#define MJPEG_Q_REG_Q_1_08_MSK  (((1U << MJPEG_Q_REG_Q_1_08_LEN) - 1) << MJPEG_Q_REG_Q_1_08_POS)
#define MJPEG_Q_REG_Q_1_08_UMSK (~(((1U << MJPEG_Q_REG_Q_1_08_LEN) - 1) << MJPEG_Q_REG_Q_1_08_POS))
#define MJPEG_Q_REG_Q_1_09      MJPEG_Q_REG_Q_1_09
#define MJPEG_Q_REG_Q_1_09_POS  (16U)
#define MJPEG_Q_REG_Q_1_09_LEN  (12U)
#define MJPEG_Q_REG_Q_1_09_MSK  (((1U << MJPEG_Q_REG_Q_1_09_LEN) - 1) << MJPEG_Q_REG_Q_1_09_POS)
#define MJPEG_Q_REG_Q_1_09_UMSK (~(((1U << MJPEG_Q_REG_Q_1_09_LEN) - 1) << MJPEG_Q_REG_Q_1_09_POS))

/* 0x494 : mjpeg_q_param_4a */
#define MJPEG_Q_PARAM_4A_OFFSET (0x494)
#define MJPEG_Q_REG_Q_1_0A      MJPEG_Q_REG_Q_1_0A
#define MJPEG_Q_REG_Q_1_0A_POS  (0U)
#define MJPEG_Q_REG_Q_1_0A_LEN  (12U)
#define MJPEG_Q_REG_Q_1_0A_MSK  (((1U << MJPEG_Q_REG_Q_1_0A_LEN) - 1) << MJPEG_Q_REG_Q_1_0A_POS)
#define MJPEG_Q_REG_Q_1_0A_UMSK (~(((1U << MJPEG_Q_REG_Q_1_0A_LEN) - 1) << MJPEG_Q_REG_Q_1_0A_POS))
#define MJPEG_Q_REG_Q_1_0B      MJPEG_Q_REG_Q_1_0B
#define MJPEG_Q_REG_Q_1_0B_POS  (16U)
#define MJPEG_Q_REG_Q_1_0B_LEN  (12U)
#define MJPEG_Q_REG_Q_1_0B_MSK  (((1U << MJPEG_Q_REG_Q_1_0B_LEN) - 1) << MJPEG_Q_REG_Q_1_0B_POS)
#define MJPEG_Q_REG_Q_1_0B_UMSK (~(((1U << MJPEG_Q_REG_Q_1_0B_LEN) - 1) << MJPEG_Q_REG_Q_1_0B_POS))

