RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/mjpeg_q_reg.h
/* 0x498 : mjpeg_q_param_4c */
#define MJPEG_Q_PARAM_4C_OFFSET (0x498)
#define MJPEG_Q_REG_Q_1_0C      MJPEG_Q_REG_Q_1_0C
#define MJPEG_Q_REG_Q_1_0C_POS  (0U)
#define MJPEG_Q_REG_Q_1_0C_LEN  (12U)
#define MJPEG_Q_REG_Q_1_0C_MSK  (((1U << MJPEG_Q_REG_Q_1_0C_LEN) - 1) << MJPEG_Q_REG_Q_1_0C_POS)
#define MJPEG_Q_REG_Q_1_0C_UMSK (~(((1U << MJPEG_Q_REG_Q_1_0C_LEN) - 1) << MJPEG_Q_REG_Q_1_0C_POS))
#define MJPEG_Q_REG_Q_1_0D      MJPEG_Q_REG_Q_1_0D
#define MJPEG_Q_REG_Q_1_0D_POS  (16U)
#define MJPEG_Q_REG_Q_1_0D_LEN  (12U)
#define MJPEG_Q_REG_Q_1_0D_MSK  (((1U << MJPEG_Q_REG_Q_1_0D_LEN) - 1) << MJPEG_Q_REG_Q_1_0D_POS)
#define MJPEG_Q_REG_Q_1_0D_UMSK (~(((1U << MJPEG_Q_REG_Q_1_0D_LEN) - 1) << MJPEG_Q_REG_Q_1_0D_POS))

/* 0x49C : mjpeg_q_param_4e */
#define MJPEG_Q_PARAM_4E_OFFSET (0x49C)
#define MJPEG_Q_REG_Q_1_0E      MJPEG_Q_REG_Q_1_0E
#define MJPEG_Q_REG_Q_1_0E_POS  (0U)
#define MJPEG_Q_REG_Q_1_0E_LEN  (12U)
#define MJPEG_Q_REG_Q_1_0E_MSK  (((1U << MJPEG_Q_REG_Q_1_0E_LEN) - 1) << MJPEG_Q_REG_Q_1_0E_POS)
#define MJPEG_Q_REG_Q_1_0E_UMSK (~(((1U << MJPEG_Q_REG_Q_1_0E_LEN) - 1) << MJPEG_Q_REG_Q_1_0E_POS))
#define MJPEG_Q_REG_Q_1_0F      MJPEG_Q_REG_Q_1_0F
#define MJPEG_Q_REG_Q_1_0F_POS  (16U)
#define MJPEG_Q_REG_Q_1_0F_LEN  (12U)
#define MJPEG_Q_REG_Q_1_0F_MSK  (((1U << MJPEG_Q_REG_Q_1_0F_LEN) - 1) << MJPEG_Q_REG_Q_1_0F_POS)
#define MJPEG_Q_REG_Q_1_0F_UMSK (~(((1U << MJPEG_Q_REG_Q_1_0F_LEN) - 1) << MJPEG_Q_REG_Q_1_0F_POS))

/* 0x4A0 : mjpeg_q_param_50 */
#define MJPEG_Q_PARAM_50_OFFSET (0x4A0)
#define MJPEG_Q_REG_Q_1_10      MJPEG_Q_REG_Q_1_10
#define MJPEG_Q_REG_Q_1_10_POS  (0U)
#define MJPEG_Q_REG_Q_1_10_LEN  (12U)
#define MJPEG_Q_REG_Q_1_10_MSK  (((1U << MJPEG_Q_REG_Q_1_10_LEN) - 1) << MJPEG_Q_REG_Q_1_10_POS)
#define MJPEG_Q_REG_Q_1_10_UMSK (~(((1U << MJPEG_Q_REG_Q_1_10_LEN) - 1) << MJPEG_Q_REG_Q_1_10_POS))
#define MJPEG_Q_REG_Q_1_11      MJPEG_Q_REG_Q_1_11
#define MJPEG_Q_REG_Q_1_11_POS  (16U)
#define MJPEG_Q_REG_Q_1_11_LEN  (12U)
#define MJPEG_Q_REG_Q_1_11_MSK  (((1U << MJPEG_Q_REG_Q_1_11_LEN) - 1) << MJPEG_Q_REG_Q_1_11_POS)
#define MJPEG_Q_REG_Q_1_11_UMSK (~(((1U << MJPEG_Q_REG_Q_1_11_LEN) - 1) << MJPEG_Q_REG_Q_1_11_POS))

/* 0x4A4 : mjpeg_q_param_52 */
#define MJPEG_Q_PARAM_52_OFFSET (0x4A4)
#define MJPEG_Q_REG_Q_1_12      MJPEG_Q_REG_Q_1_12
#define MJPEG_Q_REG_Q_1_12_POS  (0U)
#define MJPEG_Q_REG_Q_1_12_LEN  (12U)
#define MJPEG_Q_REG_Q_1_12_MSK  (((1U << MJPEG_Q_REG_Q_1_12_LEN) - 1) << MJPEG_Q_REG_Q_1_12_POS)
#define MJPEG_Q_REG_Q_1_12_UMSK (~(((1U << MJPEG_Q_REG_Q_1_12_LEN) - 1) << MJPEG_Q_REG_Q_1_12_POS))
#define MJPEG_Q_REG_Q_1_13      MJPEG_Q_REG_Q_1_13
#define MJPEG_Q_REG_Q_1_13_POS  (16U)
#define MJPEG_Q_REG_Q_1_13_LEN  (12U)
#define MJPEG_Q_REG_Q_1_13_MSK  (((1U << MJPEG_Q_REG_Q_1_13_LEN) - 1) << MJPEG_Q_REG_Q_1_13_POS)
#define MJPEG_Q_REG_Q_1_13_UMSK (~(((1U << MJPEG_Q_REG_Q_1_13_LEN) - 1) << MJPEG_Q_REG_Q_1_13_POS))

/* 0x4A8 : mjpeg_q_param_54 */
#define MJPEG_Q_PARAM_54_OFFSET (0x4A8)
#define MJPEG_Q_REG_Q_1_14      MJPEG_Q_REG_Q_1_14
#define MJPEG_Q_REG_Q_1_14_POS  (0U)
#define MJPEG_Q_REG_Q_1_14_LEN  (12U)
#define MJPEG_Q_REG_Q_1_14_MSK  (((1U << MJPEG_Q_REG_Q_1_14_LEN) - 1) << MJPEG_Q_REG_Q_1_14_POS)
#define MJPEG_Q_REG_Q_1_14_UMSK (~(((1U << MJPEG_Q_REG_Q_1_14_LEN) - 1) << MJPEG_Q_REG_Q_1_14_POS))
#define MJPEG_Q_REG_Q_1_15      MJPEG_Q_REG_Q_1_15
#define MJPEG_Q_REG_Q_1_15_POS  (16U)
#define MJPEG_Q_REG_Q_1_15_LEN  (12U)
#define MJPEG_Q_REG_Q_1_15_MSK  (((1U << MJPEG_Q_REG_Q_1_15_LEN) - 1) << MJPEG_Q_REG_Q_1_15_POS)
#define MJPEG_Q_REG_Q_1_15_UMSK (~(((1U << MJPEG_Q_REG_Q_1_15_LEN) - 1) << MJPEG_Q_REG_Q_1_15_POS))

/* 0x4AC : mjpeg_q_param_56 */
#define MJPEG_Q_PARAM_56_OFFSET (0x4AC)
#define MJPEG_Q_REG_Q_1_16      MJPEG_Q_REG_Q_1_16
#define MJPEG_Q_REG_Q_1_16_POS  (0U)
#define MJPEG_Q_REG_Q_1_16_LEN  (12U)
#define MJPEG_Q_REG_Q_1_16_MSK  (((1U << MJPEG_Q_REG_Q_1_16_LEN) - 1) << MJPEG_Q_REG_Q_1_16_POS)
#define MJPEG_Q_REG_Q_1_16_UMSK (~(((1U << MJPEG_Q_REG_Q_1_16_LEN) - 1) << MJPEG_Q_REG_Q_1_16_POS))
#define MJPEG_Q_REG_Q_1_17      MJPEG_Q_REG_Q_1_17
#define MJPEG_Q_REG_Q_1_17_POS  (16U)
#define MJPEG_Q_REG_Q_1_17_LEN  (12U)
#define MJPEG_Q_REG_Q_1_17_MSK  (((1U << MJPEG_Q_REG_Q_1_17_LEN) - 1) << MJPEG_Q_REG_Q_1_17_POS)
#define MJPEG_Q_REG_Q_1_17_UMSK (~(((1U << MJPEG_Q_REG_Q_1_17_LEN) - 1) << MJPEG_Q_REG_Q_1_17_POS))

/* 0x4B0 : mjpeg_q_param_58 */
#define MJPEG_Q_PARAM_58_OFFSET (0x4B0)
#define MJPEG_Q_REG_Q_1_18      MJPEG_Q_REG_Q_1_18
#define MJPEG_Q_REG_Q_1_18_POS  (0U)
#define MJPEG_Q_REG_Q_1_18_LEN  (12U)
#define MJPEG_Q_REG_Q_1_18_MSK  (((1U << MJPEG_Q_REG_Q_1_18_LEN) - 1) << MJPEG_Q_REG_Q_1_18_POS)
#define MJPEG_Q_REG_Q_1_18_UMSK (~(((1U << MJPEG_Q_REG_Q_1_18_LEN) - 1) << MJPEG_Q_REG_Q_1_18_POS))
#define MJPEG_Q_REG_Q_1_19      MJPEG_Q_REG_Q_1_19
#define MJPEG_Q_REG_Q_1_19_POS  (16U)
#define MJPEG_Q_REG_Q_1_19_LEN  (12U)
#define MJPEG_Q_REG_Q_1_19_MSK  (((1U << MJPEG_Q_REG_Q_1_19_LEN) - 1) << MJPEG_Q_REG_Q_1_19_POS)
#define MJPEG_Q_REG_Q_1_19_UMSK (~(((1U << MJPEG_Q_REG_Q_1_19_LEN) - 1) << MJPEG_Q_REG_Q_1_19_POS))

/* 0x4B4 : mjpeg_q_param_5a */
#define MJPEG_Q_PARAM_5A_OFFSET (0x4B4)
#define MJPEG_Q_REG_Q_1_1A      MJPEG_Q_REG_Q_1_1A
#define MJPEG_Q_REG_Q_1_1A_POS  (0U)
#define MJPEG_Q_REG_Q_1_1A_LEN  (12U)
#define MJPEG_Q_REG_Q_1_1A_MSK  (((1U << MJPEG_Q_REG_Q_1_1A_LEN) - 1) << MJPEG_Q_REG_Q_1_1A_POS)
#define MJPEG_Q_REG_Q_1_1A_UMSK (~(((1U << MJPEG_Q_REG_Q_1_1A_LEN) - 1) << MJPEG_Q_REG_Q_1_1A_POS))
#define MJPEG_Q_REG_Q_1_1B      MJPEG_Q_REG_Q_1_1B
#define MJPEG_Q_REG_Q_1_1B_POS  (16U)
#define MJPEG_Q_REG_Q_1_1B_LEN  (12U)
#define MJPEG_Q_REG_Q_1_1B_MSK  (((1U << MJPEG_Q_REG_Q_1_1B_LEN) - 1) << MJPEG_Q_REG_Q_1_1B_POS)
#define MJPEG_Q_REG_Q_1_1B_UMSK (~(((1U << MJPEG_Q_REG_Q_1_1B_LEN) - 1) << MJPEG_Q_REG_Q_1_1B_POS))

/* 0x4B8 : mjpeg_q_param_5c */
#define MJPEG_Q_PARAM_5C_OFFSET (0x4B8)
#define MJPEG_Q_REG_Q_1_1C      MJPEG_Q_REG_Q_1_1C
#define MJPEG_Q_REG_Q_1_1C_POS  (0U)
#define MJPEG_Q_REG_Q_1_1C_LEN  (12U)
#define MJPEG_Q_REG_Q_1_1C_MSK  (((1U << MJPEG_Q_REG_Q_1_1C_LEN) - 1) << MJPEG_Q_REG_Q_1_1C_POS)
#define MJPEG_Q_REG_Q_1_1C_UMSK (~(((1U << MJPEG_Q_REG_Q_1_1C_LEN) - 1) << MJPEG_Q_REG_Q_1_1C_POS))
#define MJPEG_Q_REG_Q_1_1D      MJPEG_Q_REG_Q_1_1D
#define MJPEG_Q_REG_Q_1_1D_POS  (16U)
#define MJPEG_Q_REG_Q_1_1D_LEN  (12U)
#define MJPEG_Q_REG_Q_1_1D_MSK  (((1U << MJPEG_Q_REG_Q_1_1D_LEN) - 1) << MJPEG_Q_REG_Q_1_1D_POS)
#define MJPEG_Q_REG_Q_1_1D_UMSK (~(((1U << MJPEG_Q_REG_Q_1_1D_LEN) - 1) << MJPEG_Q_REG_Q_1_1D_POS))

/* 0x4BC : mjpeg_q_param_5e */
#define MJPEG_Q_PARAM_5E_OFFSET (0x4BC)
#define MJPEG_Q_REG_Q_1_1E      MJPEG_Q_REG_Q_1_1E
#define MJPEG_Q_REG_Q_1_1E_POS  (0U)
#define MJPEG_Q_REG_Q_1_1E_LEN  (12U)
#define MJPEG_Q_REG_Q_1_1E_MSK  (((1U << MJPEG_Q_REG_Q_1_1E_LEN) - 1) << MJPEG_Q_REG_Q_1_1E_POS)
#define MJPEG_Q_REG_Q_1_1E_UMSK (~(((1U << MJPEG_Q_REG_Q_1_1E_LEN) - 1) << MJPEG_Q_REG_Q_1_1E_POS))
#define MJPEG_Q_REG_Q_1_1F      MJPEG_Q_REG_Q_1_1F
#define MJPEG_Q_REG_Q_1_1F_POS  (16U)
#define MJPEG_Q_REG_Q_1_1F_LEN  (12U)
#define MJPEG_Q_REG_Q_1_1F_MSK  (((1U << MJPEG_Q_REG_Q_1_1F_LEN) - 1) << MJPEG_Q_REG_Q_1_1F_POS)
#define MJPEG_Q_REG_Q_1_1F_UMSK (~(((1U << MJPEG_Q_REG_Q_1_1F_LEN) - 1) << MJPEG_Q_REG_Q_1_1F_POS))

/* 0x4C0 : mjpeg_q_param_60 */
#define MJPEG_Q_PARAM_60_OFFSET (0x4C0)
#define MJPEG_Q_REG_Q_1_20      MJPEG_Q_REG_Q_1_20
#define MJPEG_Q_REG_Q_1_20_POS  (0U)
#define MJPEG_Q_REG_Q_1_20_LEN  (12U)
#define MJPEG_Q_REG_Q_1_20_MSK  (((1U << MJPEG_Q_REG_Q_1_20_LEN) - 1) << MJPEG_Q_REG_Q_1_20_POS)
#define MJPEG_Q_REG_Q_1_20_UMSK (~(((1U << MJPEG_Q_REG_Q_1_20_LEN) - 1) << MJPEG_Q_REG_Q_1_20_POS))
#define MJPEG_Q_REG_Q_1_21      MJPEG_Q_REG_Q_1_21
#define MJPEG_Q_REG_Q_1_21_POS  (16U)
#define MJPEG_Q_REG_Q_1_21_LEN  (12U)
#define MJPEG_Q_REG_Q_1_21_MSK  (((1U << MJPEG_Q_REG_Q_1_21_LEN) - 1) << MJPEG_Q_REG_Q_1_21_POS)
#define MJPEG_Q_REG_Q_1_21_UMSK (~(((1U << MJPEG_Q_REG_Q_1_21_LEN) - 1) << MJPEG_Q_REG_Q_1_21_POS))

/* 0x4C4 : mjpeg_q_param_62 */
#define MJPEG_Q_PARAM_62_OFFSET (0x4C4)
#define MJPEG_Q_REG_Q_1_22      MJPEG_Q_REG_Q_1_22
#define MJPEG_Q_REG_Q_1_22_POS  (0U)
#define MJPEG_Q_REG_Q_1_22_LEN  (12U)
#define MJPEG_Q_REG_Q_1_22_MSK  (((1U << MJPEG_Q_REG_Q_1_22_LEN) - 1) << MJPEG_Q_REG_Q_1_22_POS)
#define MJPEG_Q_REG_Q_1_22_UMSK (~(((1U << MJPEG_Q_REG_Q_1_22_LEN) - 1) << MJPEG_Q_REG_Q_1_22_POS))
#define MJPEG_Q_REG_Q_1_23      MJPEG_Q_REG_Q_1_23
#define MJPEG_Q_REG_Q_1_23_POS  (16U)
#define MJPEG_Q_REG_Q_1_23_LEN  (12U)
#define MJPEG_Q_REG_Q_1_23_MSK  (((1U << MJPEG_Q_REG_Q_1_23_LEN) - 1) << MJPEG_Q_REG_Q_1_23_POS)
#define MJPEG_Q_REG_Q_1_23_UMSK (~(((1U << MJPEG_Q_REG_Q_1_23_LEN) - 1) << MJPEG_Q_REG_Q_1_23_POS))

