RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/mjpeg_q_reg.h
/* 0x4C8 : mjpeg_q_param_64 */
#define MJPEG_Q_PARAM_64_OFFSET (0x4C8)
#define MJPEG_Q_REG_Q_1_24      MJPEG_Q_REG_Q_1_24
#define MJPEG_Q_REG_Q_1_24_POS  (0U)
#define MJPEG_Q_REG_Q_1_24_LEN  (12U)
#define MJPEG_Q_REG_Q_1_24_MSK  (((1U << MJPEG_Q_REG_Q_1_24_LEN) - 1) << MJPEG_Q_REG_Q_1_24_POS)
#define MJPEG_Q_REG_Q_1_24_UMSK (~(((1U << MJPEG_Q_REG_Q_1_24_LEN) - 1) << MJPEG_Q_REG_Q_1_24_POS))
#define MJPEG_Q_REG_Q_1_25      MJPEG_Q_REG_Q_1_25
#define MJPEG_Q_REG_Q_1_25_POS  (16U)
#define MJPEG_Q_REG_Q_1_25_LEN  (12U)
#define MJPEG_Q_REG_Q_1_25_MSK  (((1U << MJPEG_Q_REG_Q_1_25_LEN) - 1) << MJPEG_Q_REG_Q_1_25_POS)
#define MJPEG_Q_REG_Q_1_25_UMSK (~(((1U << MJPEG_Q_REG_Q_1_25_LEN) - 1) << MJPEG_Q_REG_Q_1_25_POS))

/* 0x4CC : mjpeg_q_param_66 */
#define MJPEG_Q_PARAM_66_OFFSET (0x4CC)
#define MJPEG_Q_REG_Q_1_26      MJPEG_Q_REG_Q_1_26
#define MJPEG_Q_REG_Q_1_26_POS  (0U)
#define MJPEG_Q_REG_Q_1_26_LEN  (12U)
#define MJPEG_Q_REG_Q_1_26_MSK  (((1U << MJPEG_Q_REG_Q_1_26_LEN) - 1) << MJPEG_Q_REG_Q_1_26_POS)
#define MJPEG_Q_REG_Q_1_26_UMSK (~(((1U << MJPEG_Q_REG_Q_1_26_LEN) - 1) << MJPEG_Q_REG_Q_1_26_POS))
#define MJPEG_Q_REG_Q_1_27      MJPEG_Q_REG_Q_1_27
#define MJPEG_Q_REG_Q_1_27_POS  (16U)
#define MJPEG_Q_REG_Q_1_27_LEN  (12U)
#define MJPEG_Q_REG_Q_1_27_MSK  (((1U << MJPEG_Q_REG_Q_1_27_LEN) - 1) << MJPEG_Q_REG_Q_1_27_POS)
#define MJPEG_Q_REG_Q_1_27_UMSK (~(((1U << MJPEG_Q_REG_Q_1_27_LEN) - 1) << MJPEG_Q_REG_Q_1_27_POS))

/* 0x4D0 : mjpeg_q_param_68 */
#define MJPEG_Q_PARAM_68_OFFSET (0x4D0)
#define MJPEG_Q_REG_Q_1_28      MJPEG_Q_REG_Q_1_28
#define MJPEG_Q_REG_Q_1_28_POS  (0U)
#define MJPEG_Q_REG_Q_1_28_LEN  (12U)
#define MJPEG_Q_REG_Q_1_28_MSK  (((1U << MJPEG_Q_REG_Q_1_28_LEN) - 1) << MJPEG_Q_REG_Q_1_28_POS)
#define MJPEG_Q_REG_Q_1_28_UMSK (~(((1U << MJPEG_Q_REG_Q_1_28_LEN) - 1) << MJPEG_Q_REG_Q_1_28_POS))
#define MJPEG_Q_REG_Q_1_29      MJPEG_Q_REG_Q_1_29
#define MJPEG_Q_REG_Q_1_29_POS  (16U)
#define MJPEG_Q_REG_Q_1_29_LEN  (12U)
#define MJPEG_Q_REG_Q_1_29_MSK  (((1U << MJPEG_Q_REG_Q_1_29_LEN) - 1) << MJPEG_Q_REG_Q_1_29_POS)
#define MJPEG_Q_REG_Q_1_29_UMSK (~(((1U << MJPEG_Q_REG_Q_1_29_LEN) - 1) << MJPEG_Q_REG_Q_1_29_POS))

/* 0x4D4 : mjpeg_q_param_6a */
#define MJPEG_Q_PARAM_6A_OFFSET (0x4D4)
#define MJPEG_Q_REG_Q_1_2A      MJPEG_Q_REG_Q_1_2A
#define MJPEG_Q_REG_Q_1_2A_POS  (0U)
#define MJPEG_Q_REG_Q_1_2A_LEN  (12U)
#define MJPEG_Q_REG_Q_1_2A_MSK  (((1U << MJPEG_Q_REG_Q_1_2A_LEN) - 1) << MJPEG_Q_REG_Q_1_2A_POS)
#define MJPEG_Q_REG_Q_1_2A_UMSK (~(((1U << MJPEG_Q_REG_Q_1_2A_LEN) - 1) << MJPEG_Q_REG_Q_1_2A_POS))
#define MJPEG_Q_REG_Q_1_2B      MJPEG_Q_REG_Q_1_2B
#define MJPEG_Q_REG_Q_1_2B_POS  (16U)
#define MJPEG_Q_REG_Q_1_2B_LEN  (12U)
#define MJPEG_Q_REG_Q_1_2B_MSK  (((1U << MJPEG_Q_REG_Q_1_2B_LEN) - 1) << MJPEG_Q_REG_Q_1_2B_POS)
#define MJPEG_Q_REG_Q_1_2B_UMSK (~(((1U << MJPEG_Q_REG_Q_1_2B_LEN) - 1) << MJPEG_Q_REG_Q_1_2B_POS))

/* 0x4D8 : mjpeg_q_param_6c */
#define MJPEG_Q_PARAM_6C_OFFSET (0x4D8)
#define MJPEG_Q_REG_Q_1_2C      MJPEG_Q_REG_Q_1_2C
#define MJPEG_Q_REG_Q_1_2C_POS  (0U)
#define MJPEG_Q_REG_Q_1_2C_LEN  (12U)
#define MJPEG_Q_REG_Q_1_2C_MSK  (((1U << MJPEG_Q_REG_Q_1_2C_LEN) - 1) << MJPEG_Q_REG_Q_1_2C_POS)
#define MJPEG_Q_REG_Q_1_2C_UMSK (~(((1U << MJPEG_Q_REG_Q_1_2C_LEN) - 1) << MJPEG_Q_REG_Q_1_2C_POS))
#define MJPEG_Q_REG_Q_1_2D      MJPEG_Q_REG_Q_1_2D
#define MJPEG_Q_REG_Q_1_2D_POS  (16U)
#define MJPEG_Q_REG_Q_1_2D_LEN  (12U)
#define MJPEG_Q_REG_Q_1_2D_MSK  (((1U << MJPEG_Q_REG_Q_1_2D_LEN) - 1) << MJPEG_Q_REG_Q_1_2D_POS)
#define MJPEG_Q_REG_Q_1_2D_UMSK (~(((1U << MJPEG_Q_REG_Q_1_2D_LEN) - 1) << MJPEG_Q_REG_Q_1_2D_POS))

/* 0x4DC : mjpeg_q_param_6e */
#define MJPEG_Q_PARAM_6E_OFFSET (0x4DC)
#define MJPEG_Q_REG_Q_1_2E      MJPEG_Q_REG_Q_1_2E
#define MJPEG_Q_REG_Q_1_2E_POS  (0U)
#define MJPEG_Q_REG_Q_1_2E_LEN  (12U)
#define MJPEG_Q_REG_Q_1_2E_MSK  (((1U << MJPEG_Q_REG_Q_1_2E_LEN) - 1) << MJPEG_Q_REG_Q_1_2E_POS)
#define MJPEG_Q_REG_Q_1_2E_UMSK (~(((1U << MJPEG_Q_REG_Q_1_2E_LEN) - 1) << MJPEG_Q_REG_Q_1_2E_POS))
#define MJPEG_Q_REG_Q_1_2F      MJPEG_Q_REG_Q_1_2F
#define MJPEG_Q_REG_Q_1_2F_POS  (16U)
#define MJPEG_Q_REG_Q_1_2F_LEN  (12U)
#define MJPEG_Q_REG_Q_1_2F_MSK  (((1U << MJPEG_Q_REG_Q_1_2F_LEN) - 1) << MJPEG_Q_REG_Q_1_2F_POS)
#define MJPEG_Q_REG_Q_1_2F_UMSK (~(((1U << MJPEG_Q_REG_Q_1_2F_LEN) - 1) << MJPEG_Q_REG_Q_1_2F_POS))

/* 0x4E0 : mjpeg_q_param_70 */
#define MJPEG_Q_PARAM_70_OFFSET (0x4E0)
#define MJPEG_Q_REG_Q_1_30      MJPEG_Q_REG_Q_1_30
#define MJPEG_Q_REG_Q_1_30_POS  (0U)
#define MJPEG_Q_REG_Q_1_30_LEN  (12U)
#define MJPEG_Q_REG_Q_1_30_MSK  (((1U << MJPEG_Q_REG_Q_1_30_LEN) - 1) << MJPEG_Q_REG_Q_1_30_POS)
#define MJPEG_Q_REG_Q_1_30_UMSK (~(((1U << MJPEG_Q_REG_Q_1_30_LEN) - 1) << MJPEG_Q_REG_Q_1_30_POS))
#define MJPEG_Q_REG_Q_1_31      MJPEG_Q_REG_Q_1_31
#define MJPEG_Q_REG_Q_1_31_POS  (16U)
#define MJPEG_Q_REG_Q_1_31_LEN  (12U)
#define MJPEG_Q_REG_Q_1_31_MSK  (((1U << MJPEG_Q_REG_Q_1_31_LEN) - 1) << MJPEG_Q_REG_Q_1_31_POS)
#define MJPEG_Q_REG_Q_1_31_UMSK (~(((1U << MJPEG_Q_REG_Q_1_31_LEN) - 1) << MJPEG_Q_REG_Q_1_31_POS))

/* 0x4E4 : mjpeg_q_param_72 */
#define MJPEG_Q_PARAM_72_OFFSET (0x4E4)
#define MJPEG_Q_REG_Q_1_32      MJPEG_Q_REG_Q_1_32
#define MJPEG_Q_REG_Q_1_32_POS  (0U)
#define MJPEG_Q_REG_Q_1_32_LEN  (12U)
#define MJPEG_Q_REG_Q_1_32_MSK  (((1U << MJPEG_Q_REG_Q_1_32_LEN) - 1) << MJPEG_Q_REG_Q_1_32_POS)
#define MJPEG_Q_REG_Q_1_32_UMSK (~(((1U << MJPEG_Q_REG_Q_1_32_LEN) - 1) << MJPEG_Q_REG_Q_1_32_POS))
#define MJPEG_Q_REG_Q_1_33      MJPEG_Q_REG_Q_1_33
#define MJPEG_Q_REG_Q_1_33_POS  (16U)
#define MJPEG_Q_REG_Q_1_33_LEN  (12U)
#define MJPEG_Q_REG_Q_1_33_MSK  (((1U << MJPEG_Q_REG_Q_1_33_LEN) - 1) << MJPEG_Q_REG_Q_1_33_POS)
#define MJPEG_Q_REG_Q_1_33_UMSK (~(((1U << MJPEG_Q_REG_Q_1_33_LEN) - 1) << MJPEG_Q_REG_Q_1_33_POS))

/* 0x4E8 : mjpeg_q_param_74 */
#define MJPEG_Q_PARAM_74_OFFSET (0x4E8)
#define MJPEG_Q_REG_Q_1_34      MJPEG_Q_REG_Q_1_34
#define MJPEG_Q_REG_Q_1_34_POS  (0U)
#define MJPEG_Q_REG_Q_1_34_LEN  (12U)
#define MJPEG_Q_REG_Q_1_34_MSK  (((1U << MJPEG_Q_REG_Q_1_34_LEN) - 1) << MJPEG_Q_REG_Q_1_34_POS)
#define MJPEG_Q_REG_Q_1_34_UMSK (~(((1U << MJPEG_Q_REG_Q_1_34_LEN) - 1) << MJPEG_Q_REG_Q_1_34_POS))
#define MJPEG_Q_REG_Q_1_35      MJPEG_Q_REG_Q_1_35
#define MJPEG_Q_REG_Q_1_35_POS  (16U)
#define MJPEG_Q_REG_Q_1_35_LEN  (12U)
#define MJPEG_Q_REG_Q_1_35_MSK  (((1U << MJPEG_Q_REG_Q_1_35_LEN) - 1) << MJPEG_Q_REG_Q_1_35_POS)
#define MJPEG_Q_REG_Q_1_35_UMSK (~(((1U << MJPEG_Q_REG_Q_1_35_LEN) - 1) << MJPEG_Q_REG_Q_1_35_POS))

