RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/mjpeg_q_reg.h
/* 0x4EC : mjpeg_q_param_76 */
#define MJPEG_Q_PARAM_76_OFFSET (0x4EC)
#define MJPEG_Q_REG_Q_1_36      MJPEG_Q_REG_Q_1_36
#define MJPEG_Q_REG_Q_1_36_POS  (0U)
#define MJPEG_Q_REG_Q_1_36_LEN  (12U)
#define MJPEG_Q_REG_Q_1_36_MSK  (((1U << MJPEG_Q_REG_Q_1_36_LEN) - 1) << MJPEG_Q_REG_Q_1_36_POS)
#define MJPEG_Q_REG_Q_1_36_UMSK (~(((1U << MJPEG_Q_REG_Q_1_36_LEN) - 1) << MJPEG_Q_REG_Q_1_36_POS))
#define MJPEG_Q_REG_Q_1_37      MJPEG_Q_REG_Q_1_37
#define MJPEG_Q_REG_Q_1_37_POS  (16U)
#define MJPEG_Q_REG_Q_1_37_LEN  (12U)
#define MJPEG_Q_REG_Q_1_37_MSK  (((1U << MJPEG_Q_REG_Q_1_37_LEN) - 1) << MJPEG_Q_REG_Q_1_37_POS)
#define MJPEG_Q_REG_Q_1_37_UMSK (~(((1U << MJPEG_Q_REG_Q_1_37_LEN) - 1) << MJPEG_Q_REG_Q_1_37_POS))

/* 0x4F0 : mjpeg_q_param_78 */
#define MJPEG_Q_PARAM_78_OFFSET (0x4F0)
#define MJPEG_Q_REG_Q_1_38      MJPEG_Q_REG_Q_1_38
#define MJPEG_Q_REG_Q_1_38_POS  (0U)
#define MJPEG_Q_REG_Q_1_38_LEN  (12U)
#define MJPEG_Q_REG_Q_1_38_MSK  (((1U << MJPEG_Q_REG_Q_1_38_LEN) - 1) << MJPEG_Q_REG_Q_1_38_POS)
#define MJPEG_Q_REG_Q_1_38_UMSK (~(((1U << MJPEG_Q_REG_Q_1_38_LEN) - 1) << MJPEG_Q_REG_Q_1_38_POS))
#define MJPEG_Q_REG_Q_1_39      MJPEG_Q_REG_Q_1_39
#define MJPEG_Q_REG_Q_1_39_POS  (16U)
#define MJPEG_Q_REG_Q_1_39_LEN  (12U)
#define MJPEG_Q_REG_Q_1_39_MSK  (((1U << MJPEG_Q_REG_Q_1_39_LEN) - 1) << MJPEG_Q_REG_Q_1_39_POS)
#define MJPEG_Q_REG_Q_1_39_UMSK (~(((1U << MJPEG_Q_REG_Q_1_39_LEN) - 1) << MJPEG_Q_REG_Q_1_39_POS))

/* 0x4F4 : mjpeg_q_param_7a */
#define MJPEG_Q_PARAM_7A_OFFSET (0x4F4)
#define MJPEG_Q_REG_Q_1_3A      MJPEG_Q_REG_Q_1_3A
#define MJPEG_Q_REG_Q_1_3A_POS  (0U)
#define MJPEG_Q_REG_Q_1_3A_LEN  (12U)
#define MJPEG_Q_REG_Q_1_3A_MSK  (((1U << MJPEG_Q_REG_Q_1_3A_LEN) - 1) << MJPEG_Q_REG_Q_1_3A_POS)
#define MJPEG_Q_REG_Q_1_3A_UMSK (~(((1U << MJPEG_Q_REG_Q_1_3A_LEN) - 1) << MJPEG_Q_REG_Q_1_3A_POS))
#define MJPEG_Q_REG_Q_1_3B      MJPEG_Q_REG_Q_1_3B
#define MJPEG_Q_REG_Q_1_3B_POS  (16U)
#define MJPEG_Q_REG_Q_1_3B_LEN  (12U)
#define MJPEG_Q_REG_Q_1_3B_MSK  (((1U << MJPEG_Q_REG_Q_1_3B_LEN) - 1) << MJPEG_Q_REG_Q_1_3B_POS)
#define MJPEG_Q_REG_Q_1_3B_UMSK (~(((1U << MJPEG_Q_REG_Q_1_3B_LEN) - 1) << MJPEG_Q_REG_Q_1_3B_POS))

/* 0x4F8 : mjpeg_q_param_7c */
#define MJPEG_Q_PARAM_7C_OFFSET (0x4F8)
#define MJPEG_Q_REG_Q_1_3C      MJPEG_Q_REG_Q_1_3C
#define MJPEG_Q_REG_Q_1_3C_POS  (0U)
#define MJPEG_Q_REG_Q_1_3C_LEN  (12U)
#define MJPEG_Q_REG_Q_1_3C_MSK  (((1U << MJPEG_Q_REG_Q_1_3C_LEN) - 1) << MJPEG_Q_REG_Q_1_3C_POS)
#define MJPEG_Q_REG_Q_1_3C_UMSK (~(((1U << MJPEG_Q_REG_Q_1_3C_LEN) - 1) << MJPEG_Q_REG_Q_1_3C_POS))
#define MJPEG_Q_REG_Q_1_3D      MJPEG_Q_REG_Q_1_3D
#define MJPEG_Q_REG_Q_1_3D_POS  (16U)
#define MJPEG_Q_REG_Q_1_3D_LEN  (12U)
#define MJPEG_Q_REG_Q_1_3D_MSK  (((1U << MJPEG_Q_REG_Q_1_3D_LEN) - 1) << MJPEG_Q_REG_Q_1_3D_POS)
#define MJPEG_Q_REG_Q_1_3D_UMSK (~(((1U << MJPEG_Q_REG_Q_1_3D_LEN) - 1) << MJPEG_Q_REG_Q_1_3D_POS))

/* 0x4FC : mjpeg_q_param_7e */
#define MJPEG_Q_PARAM_7E_OFFSET (0x4FC)
#define MJPEG_Q_REG_Q_1_3E      MJPEG_Q_REG_Q_1_3E
#define MJPEG_Q_REG_Q_1_3E_POS  (0U)
#define MJPEG_Q_REG_Q_1_3E_LEN  (12U)
#define MJPEG_Q_REG_Q_1_3E_MSK  (((1U << MJPEG_Q_REG_Q_1_3E_LEN) - 1) << MJPEG_Q_REG_Q_1_3E_POS)
#define MJPEG_Q_REG_Q_1_3E_UMSK (~(((1U << MJPEG_Q_REG_Q_1_3E_LEN) - 1) << MJPEG_Q_REG_Q_1_3E_POS))
#define MJPEG_Q_REG_Q_1_3F      MJPEG_Q_REG_Q_1_3F
#define MJPEG_Q_REG_Q_1_3F_POS  (16U)
#define MJPEG_Q_REG_Q_1_3F_LEN  (12U)
#define MJPEG_Q_REG_Q_1_3F_MSK  (((1U << MJPEG_Q_REG_Q_1_3F_LEN) - 1) << MJPEG_Q_REG_Q_1_3F_POS)
#define MJPEG_Q_REG_Q_1_3F_UMSK (~(((1U << MJPEG_Q_REG_Q_1_3F_LEN) - 1) << MJPEG_Q_REG_Q_1_3F_POS))

struct mjpeg_q_reg {
    /* 0x0  reserved */
    uint8_t RESERVED0x0[1024];

    /* 0x400 : mjpeg_q_param_00 */
    union {
        struct {
            uint32_t reg_q_0_00     : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15 : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t reg_q_0_01     : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31 : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_q_param_00;

    /* 0x404 : mjpeg_q_param_02 */
    union {
        struct {
            uint32_t reg_q_0_02     : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15 : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t reg_q_0_03     : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31 : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_q_param_02;

    /* 0x408 : mjpeg_q_param_04 */
    union {
        struct {
            uint32_t reg_q_0_04     : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15 : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t reg_q_0_05     : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31 : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_q_param_04;

    /* 0x40C : mjpeg_q_param_06 */
    union {
        struct {
            uint32_t reg_q_0_06     : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15 : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t reg_q_0_07     : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31 : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_q_param_06;

    /* 0x410 : mjpeg_q_param_08 */
    union {
        struct {
            uint32_t reg_q_0_08     : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15 : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t reg_q_0_09     : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31 : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_q_param_08;

    /* 0x414 : mjpeg_q_param_0a */
    union {
        struct {
            uint32_t reg_q_0_0a     : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15 : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t reg_q_0_0b     : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31 : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_q_param_0a;

    /* 0x418 : mjpeg_q_param_0c */
    union {
        struct {
            uint32_t reg_q_0_0c     : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15 : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t reg_q_0_0d     : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31 : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_q_param_0c;

    /* 0x41C : mjpeg_q_param_0e */
    union {
        struct {
            uint32_t reg_q_0_0e     : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15 : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t reg_q_0_0f     : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31 : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_q_param_0e;

