RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/mjpeg_q_reg.h
    /* 0x474 : mjpeg_q_param_3a */
    union {
        struct {
            uint32_t reg_q_0_3a     : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15 : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t reg_q_0_3b     : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31 : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_q_param_3a;

    /* 0x478 : mjpeg_q_param_3c */
    union {
        struct {
            uint32_t reg_q_0_3c     : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15 : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t reg_q_0_3d     : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31 : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_q_param_3c;

    /* 0x47C : mjpeg_q_param_3e */
    union {
        struct {
            uint32_t reg_q_0_3e     : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15 : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t reg_q_0_3f     : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31 : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_q_param_3e;

    /* 0x480 : mjpeg_q_param_40 */
    union {
        struct {
            uint32_t reg_q_1_00     : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15 : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t reg_q_1_01     : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31 : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_q_param_40;

    /* 0x484 : mjpeg_q_param_42 */
    union {
        struct {
            uint32_t reg_q_1_02     : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15 : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t reg_q_1_03     : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31 : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_q_param_42;

    /* 0x488 : mjpeg_q_param_44 */
    union {
        struct {
            uint32_t reg_q_1_04     : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15 : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t reg_q_1_05     : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31 : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_q_param_44;

    /* 0x48C : mjpeg_q_param_46 */
    union {
        struct {
            uint32_t reg_q_1_06     : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15 : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t reg_q_1_07     : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31 : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_q_param_46;

    /* 0x490 : mjpeg_q_param_48 */
    union {
        struct {
            uint32_t reg_q_1_08     : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15 : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t reg_q_1_09     : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31 : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_q_param_48;

    /* 0x494 : mjpeg_q_param_4a */
    union {
        struct {
            uint32_t reg_q_1_0a     : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15 : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t reg_q_1_0b     : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31 : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_q_param_4a;

    /* 0x498 : mjpeg_q_param_4c */
    union {
        struct {
            uint32_t reg_q_1_0c     : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15 : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t reg_q_1_0d     : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31 : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_q_param_4c;

    /* 0x49C : mjpeg_q_param_4e */
    union {
        struct {
            uint32_t reg_q_1_0e     : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15 : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t reg_q_1_0f     : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31 : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_q_param_4e;

    /* 0x4A0 : mjpeg_q_param_50 */
    union {
        struct {
            uint32_t reg_q_1_10     : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15 : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t reg_q_1_11     : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31 : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_q_param_50;

    /* 0x4A4 : mjpeg_q_param_52 */
    union {
        struct {
            uint32_t reg_q_1_12     : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15 : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t reg_q_1_13     : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31 : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_q_param_52;

    /* 0x4A8 : mjpeg_q_param_54 */
    union {
        struct {
            uint32_t reg_q_1_14     : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15 : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t reg_q_1_15     : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31 : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_q_param_54;

    /* 0x4AC : mjpeg_q_param_56 */
    union {
        struct {
            uint32_t reg_q_1_16     : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15 : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t reg_q_1_17     : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31 : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_q_param_56;

    /* 0x4B0 : mjpeg_q_param_58 */
    union {
        struct {
            uint32_t reg_q_1_18     : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15 : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t reg_q_1_19     : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31 : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_q_param_58;

    /* 0x4B4 : mjpeg_q_param_5a */
    union {
        struct {
            uint32_t reg_q_1_1a     : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15 : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t reg_q_1_1b     : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31 : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_q_param_5a;

